### 迴圈敘述
#3-1
#範例01
#若我們想要計算1加100 的總和,其執行流程圖如下:
'''3-1 while 敘述
while 的迴圈敘述如下:
初值設定
while 條件運算式:
      主體敘述

若我們想要計算1加100 的總和,其執行流程圖如下:
                                    i = 1
                                         ↓
                                    total = 0
                                         ↓
                                      i<= 100
                                         ↓
                                    total += i
                                         ↓
                                    i+=1
                                         ↓
                                    印出total
'''
i = 1
total = 0
while  i<= 100:
       total += i #total = total + i
       i += 1     #i = i + 1
print('total = ', total)

i = 1
total = 0
while  i<= 100:
       total += i #total = total + i
       print("total = ", total)
       i += 1     #i = i + 1
       print("i = ", i)
print('total = ', total)
#total = 5050

## 無窮迴圈
i = 1
total = 0
while  i<= 100:
       total += i #total = total + i
       print("total = ", total)
       print("i = ", i)
#       i += 1     #i = i + 1
#       print("i = ", i)
print('total = ', total)

i = 1
total = 0
while  i<= 100:
       total += i #total = total + i
       i += 1     #i = i + 1
print('total = ', total)

#範例02
'''注意,while 敘述後面要加分號(:)。此程式的初值設定運算式是i=1;條件運算式 是判斷i<= 100 是否為真;而更新運算式是i+=1。
而且迴圈所要執行的敘述 total += i和i+=1要對齊並内縮。若你將上述程式撰寫為:'''
i = 2
total = 0
while i <= 100:
    total += i
    i += 1
print('total = ', total)
#total = 5050

#範例03
#若將原來的程式之條件運算式改為i<100,則是計算1加到99 的總和,程式與輸
#出結果如下所示:
i = 1
total = 0
while i < 100:
    total += i
    i += 1
    print("total = ", total)
    print("i = ", i)
print('total = ', total)
#total = 4950

#範例04
#最後,若將原來程式的更新運算式改為i+=2, 則是計算1加到100 的奇數和, 程式與輸出結果如下所示:
i = 1
total = 0
while i <= 100:
    total += i
    i += 2
print('total = ', total)
#total = 2500

#########################
#3-2
#範例01
#若將上述1加到100 的 while 迴圈敘述改以 for....in range 敘述時，其對應的程式
#所示:
'''3-2  for...in range 迴圈
除了while 迴圈外,還有一個是 for....in range 迴圈敘述。

for....in range 敘述的語法如下:
for i in range(start, end, step):

其表示i是從 start 值開始,直到end-1，中間的過程是每次加 step 值,若step 值
為1,則可省略。其所對應的 while 迴圈敘述如下:
i= start
while i <= end-1:
       ...
       i+= step

若將上述1加到100 的 while 迴圈敘述改以 for....in range 敘述時，其對應的程式
所示:
'''
total = 0
for i in range (1, 101):
     total += i
     print("total = ", total)
     print("i = ", i)
print('total = ', total)
#total = 5050

total = 0
for i in range (1, 100):
     total += i
     print("total = ", total)
     print("i = ", i)
print('total = ', total)
#total = 4950

total = 0
end = 100
for i in range (1, end+1):
     total += i
     print("total = ", total)
     print("i = ", i)
print('total = ', total)
#total = 5050

#範例02
#要注意的是, end 是 101, 因為它會減1。也要注意 for 敘述的最後要加分號(:)。
#若將上述2 加到100, 以 for迴圈撰寫如下:
total = 0
for i in range (2, 101):
     total += i
print('total = ', total)
#total = 5049

#範例03
#若將上述1加到99,以 for迴圈撰寫如下:
total = 0
for i in range (1, 100):
     total += i
print('total = ', total)
#total = 4950

#########################
#3-3 巢狀迴圈(nested loop)
#範例01
#巢狀迴圈(nested loop)或稱多重迴圈,顧名思義為迴圈内又有一迴圈。表示外迴
#圈内有内迴圈。我們以下列的範例說明之。
print ("=====")
for x in range(1, 6):
    print('x = %d'%(x))
    for y in range(1, 6):
        print('  y = %d'%(y))
    print("=====")
'''======
x  =  1
y  =  1
y  =  2
y  =  3
y  =  4
y  =  5
======
x  =  2
y  =  1
y  =  2
y  =  3
y  =  4
y  =  5
======
x  =  3
y  =  1
y  =  2
y  =  3
y  =  4
y  =  5
======
x  =  4
y  =  1
y  =  2
y  =  3
y  =  4
y  =  5
======
x  =  5
y  =  1
y  =  2
y  =  3
y  =  4
y  =  5
======'''

print ("=====")
for x in range(1, 6):
    print('x = %d'%(x))
    for y in range(1, 6):
    print('  y = %d'%(y))
    print("=====")
    
print ("=====")
for x in range(1, 6):
    print('x = %d'%(x))
    for y in range(1, 6):
        print('  y = %d'%(y))
        print("=====")
    
#範例02
#99乘法表
# 9*9 multiple table
#version 1
'''當程式中外迴圈的變數x為1時,內迴圈的變數y會執行1到5。從輸出結果可得
知。接下來外迴圈的變數x 為2時,再次執行內迴圈敘述,直到 x 大於5。

有了以上的概念後,讓我們來撰寫印出九九乘法表的程式,如下所示:
'''
for x in range(1, 10):
    for y in range(1, 10):
        print('%d*%d=%2d '%(x,y,x*y))
    print()
'''1*1= 1
1*2= 2
1*3= 3
1*4= 4
1*5= 5
1*6= 6
1*7= 7
1*8= 8
1*9= 9'''

#範例03
#此敘述利用格式控制器來調整輸出結果。但此程式有一缺點就是每次都跳行。為了不讓它跳行,因此在此敘述的後面加上end =' ',如下所示:
#version 2
'''此程式的核心是
print("%d*%d=%2d'% (x,y, x*y)
此敘述利用格式控制器來調整輸出結果。但此程式有一缺點就是每次都跳行。為了不讓它跳行,因此在此敘述的後面加上end =' ',如下所示:
'''
for x in range(1, 10):
    for y in range(1, 10):
        print("%d*%d=%2d"%(x,y,x*y), end ='  ')
print()
#6*1= 6  6*2=12  6*3=18  6*4=24  6*5=30  6*6=36  6*7=42  6*8=48

#範例04
#version 3
'''每二欄之間空二格。試問這一九九乘法表是我們小時候在墊板上所看到的嗎?好像不是,應該像以下這樣才對。

1*1=1
1*2=2
1*3=3
1*4=4
1*5=5
1*6=6
1*7=7
1*8=8
1*9=9
我不排序了

喔,分析一下上述的結果,我們只要將
print("%d*%d=%2d'%(x,y,x*y), end =')
改為
print("%d*%d=%2d'%( y,x ,x*y), end =')

此時就大功告成了。從上得知每一列的結果是第一個數在變數,因此其所對應的變數應該是内迴圈的變數y,接下來才是外迴圈的變數x。
最後修改後的程式如下:
'''
for x in range(1, 10):
     for y in range(1, 10):
          print('%d *%d=%2d'%( y,x ,x*y), end =' ')
     print()
#1 *1= 1 2 *1= 2 3 *1= 3 4 *1= 4 5 *1= 5 6 *1= 6 7 *1= 7 8 *1= 8 9 *1= 9
#1 *2= 2 2 *2= 4 3 *2= 6 4 *2= 8 5 *2=10 6 *2=12 7 *2=14 8 *2=16 9 *2=18

#綜合範例01
#(1) 請使用迴圈敘述撰寫一程式,讓使用者輸入兩個正整數a、b(a<b),利
#用迴圈計算從a開始連加到b的總和。例如:輸入a-1、b=100,則輸出結果為
#5050(1+2+.. + 100 = 5050)。
#範例輸入66 和 666
'''綜合範例1:
1.請開啟 PYD03.py 檔案,依下列題意進行作答,依輸入值計算總和,使輸出值 符合題意要求。請另存新檔為 PYA03.py,作答完成請儲存所有檔案至 C:\ANS.CSF原資料夾內。
2. 設計說明:
(1) 請使用迴圈敘述撰寫一程式,讓使用者輸入兩個正整數a、b(a<b),利
用迴圈計算從a開始連加到b的總和。例如:輸入a-1、b=100,則輸出結果為
5050(1+2+.. + 100 = 5050)。

3. 輸入輸出:
(1) 輸入說明
     兩個正整數(a、b,且a<b)

(2) 輸出說明
     計算從a 開始連加到b的總和

(3) 範例輸入
     66
     666
    範例輸出
     219966
'''
a = int(input())
b = int(input())
ans = 0

for i in range(a, b+1):
     ans += i
print(ans)


a = int(input())
b = int(input())
ans = 0

for i in range(a, b+1):
     ans += i
     print('i = %d ,ans = %d'%(i, ans))
print(ans)
#output 219966

#綜合範例02
#設計說明: (1) 請使用迴圈敘述撰寫一程式,讓使用者輸入兩個正整數a、b(a<b),利用迴圈計算從a開始的偶數連加到b的總和。
#例如:輸入a=1、b=100,則輸出結果為2550 (2+4+... + 100 = 2550)。
#範例輸入14 和 1144
'''綜合範例2:
迴圈偶數連加
1. 題目說明:
請開啟 PYD03.py 檔案,依下列題意進行作答,依輸入值計算偶數的總和,使輸出值符合題意要求。請另存新檔為 PYA03.py,作答完成請儲存所有檔案至C:\ANS.CSF 原資料夾內。
2. 設計說明: (1) 請使用迴圈敘述撰寫一程式,讓使用者輸入兩個正整數a、b(a<b),利用迴圈計算從a開始的偶數連加到b的總和。例如:輸入a=1、b=100,則輸出結果為2550 (2+4+... + 100 = 2550)。

3. 輸入輸出:
(1) 輸入說明
     兩個正整數(a、b,且a<b)
(2)輸出說明
    計算從a開始的偶數連加到b的總和
(3) 範例輸入
     14
     1144
    範例輸出
    327714
'''
a = int(input())
b = int(input())
ans = 0

for i in range(a, b+1):
     if  i % 2 == 0:
           ans += i
print(ans)
# 327714

#綜合範例03
#請使用迴圈敘述撰寫一程式,讓使用者輸入一個正整數(<100),然後以
#三角形的方式依序輸出此數的階乘結果。
#* 提示:輸出欄寬為4,且需靠右對齊。
#範例輸入12
'''綜合範例3:
迴圈數值相乘

1. 題目說明:

請開啟 PYD03.py 檔案,依下列題意進行作答,依輸入值以三角形的方式輸出 此數相乘結果,使輸出值符合題意要求。請另存新檔為PYA03.py,作答完成請儲存所有檔案至C:\ANS.CSF原資料夾內。

2. 設計說明:
(1) 請使用迴圈敘述撰寫一程式,讓使用者輸入一個正整數(<100),然後以
三角形的方式依序輸出此數的階乘結果。
* 提示:輸出欄寬為4,且需靠右對齊。

3. 輸入輸出:
(1) 輸入說明
     一個正整數(<100)
(2)輸出說明
   以三角形的方式依序輸出此數的階乘結果
(3)
範例輸入
5
範例輸出
'''
num = eval(input())
for i in range(1, num+1):
     for j in range(1, i+1):
          print("%4d"%(i* j), end = '')
     print()
'''
   1
   2   4
   3   6   9
   4   8  12  16
   5  10  15  20  25
   6  12  18  24  30  36
   7  14  21  28  35  42  49
   8  16  24  32  40  48  56  64
   9  18  27  36  45  54  63  72  81
  10  20  30  40  50  60  70  80  90 100
  11  22  33  44  55  66  77  88  99 110 121
  12  24  36  48  60  72  84  96 108 120 132 144'''

#綜合範例04
#請使用迴圈敘述撰寫一程式,讓使用者輸入一個正整數a,利用迴圈計算
#從1到a之間,所有5之倍數數字總和。
#範例輸入21
'''綜合範例4:
迴圈倍數總和
1.題目說明:
請開啟 PYD03.py 檔案,依下列題意進行作答,依輸入值計算所有5之倍數總和,使輸出值符合題意要求。請另存新檔為PYA03.py,作答完成請儲存所有檔案至C:\ANS.CSF 原資料夾內。

2. 設計說明:
(1) 請使用迴圈敘述撰寫一程式,讓使用者輸入一個正整數a,利用迴圈計算
     從1到a之間,所有5之倍數數字總和。
3. 輸入輸出:
(1) 輸入說明
     一個正整數
 (2) 輸出說明
      所有5之倍數數字總和
 (3) 範例輸入
      21
      範例輸出
      50
'''
num = eval(input())
ans = 0

for i in range(1, num+1):
     if i % 5 == 0:
           ans += i
print(ans)
#output 50

num = eval(input())
ans = 0
count = 0
for i in range(1, num+1):
     if i % 5 == 0:
           ans += i
           count += 1
           print('num = ',i)
print('ans = ',ans)
print('count = ',count)
#output 50

#綜合範例05
#請使用迴圈敘述撰寫一程式,讓使用者輸入一個正整數,將此數值以反轉的順序輸出。
#範例輸入31283
'''綜合範例5:
數字反轉
1. 題目說明:
請開啟 PYD03.py 檔案,依下列題意進行作答,將輸入值進行反轉,使輸出值符合題意要求
    請另存新檔為 PYA03.py,作答完成請儲存所有檔案至 C:\ANS. CSF原資料夾內。
2. 設計說明:
    (1) 請使用迴圈敘述撰寫一程式,讓使用者輸入一個正整數,將此數值以反轉的順序輸出。
3. 輸入輸出:
(1) 輸入說明
     一個正整數
(2) 輸出說明
      將此數值以反轉的順序輸出
(3) 範例輸入
     31283
     範例輸出
      38213
(4) 範例輸入
     1003120
     範例輸出
      0213001
'''
a  =  eval (input())

while a != 0:
         print(a % 10, end = '' )
         a //= 10
#output 38213

#綜合範例06
#請使用迴圈敘述撰寫一程式,讓使用者輸入一個正整數n,利用迴圈計算並輸出 n!的值。
#範例輸入15
'''綜合範例6:
迴圈階乘計算

1. 題目說明:
    請開啟 PYD03.py 檔案,依下列題意進行作答,依輸入值計算 n! 的值,使輸出值符合題意要
    求。請另存新檔為 PYA03.py,作答完成請儲存所有檔案至 C:\ANS. CSF 原資料夾內。

 2. 設計說明:
 (1) 請使用迴圈敘述撰寫一程式,讓使用者輸入一個正整數n,利用迴圈計算並輸出 n!的值。

3. 輸入輸出:
(1)輸入說明
      一個正整數
(2)輸出說明
計算n!的值
(3) 範例輸入
     15
     範例輸出
     1307674368000
'''
n = eval(input())
result = 1
for i in range(1, n+1):
     result *= i
     print('i = ', i)
     print('result = ', result)
print(result)
#output 1307674368000

n = eval(input())
result = 1
for i in range(n, 0, -1):
     result *= i
     print('i = ', i)
     print('result = ', result)
print(result)

#綜合範例07
#(1)請使用迴圈敘述撰寫一程式,要求使用者輸入一個正整數n(n<10),顯示n*n乘法表。
#(2)每項運算式需進行格式化排列整齊,每個運算子及運算元輸出的欄寬為2, 而每項乘積輸出的欄寬為4,皆靠左對齊不跳行。
#範例輸入3
'''綜合範例7:
乘法表
1. 題目說明:
請開啟 PYD03.py 檔案,依下列題意進行作答,依輸入值計算n*n 乘法表,使輸出值符合題意
要求。請另存新檔為PYA03.py,作答完成請儲存所有檔案至 C:\ANS.CSF原資料夾內。

2.設計說明:
(1) 請使用迴圈敘述撰寫一程式,要求使用者輸入一個正整數n(n<10),顯示n*n乘法表。

(2)每項運算式需進行格式化排列整齊,每個運算子及運算元輸出的欄寬為2,
    而每項乘積輸出的欄寬為4,皆靠左對齊不跳行。
3. 輸入輸出:
(1) 輸入說明
     一個正整數n(n<10)
(2) 輸出說明
     輸出格式化的n*n 乘法表
(3) 範例輸入
      3
     範例輸出
      不打出來，請參考4.的程式碼
(4) 範例輸入
      5
     範例輸出
     不打出來，請參考4.的程式碼
'''
n = eval (input())
for i in range(1, n + 1):
    for j in range(1, n + 1):
         print("%-2d* %-2d = %-4d"%(j, i,j*i), end='')
    print()
'''output 1 * 1  = 1   2 * 1  = 2   3 * 1  = 3
1 * 2  = 2   2 * 2  = 4   3 * 2  = 6
1 * 3  = 3   2 * 3  = 6   3 * 3  = 9'''

#綜合範例08
'''綜合範例8:
迴圈位數加總

1. 題目說明:
請開啟 PYD03.py 檔案,依下列題意進行作答,將輸入值之每位數全部加總, 使輸出值符合題意要求。請另存新檔為PYA03.py,作答完成請儲存所有檔案 至C:\ANS.CSF 原資料夾內。
2.設計說明:
(1) 請使用迴圈敘述撰寫一程式,要求使用者輸入一個數字,此數字代表後面測試資料的數量。每一筆測試資料是一個正整數(由使用者輸入),將此正整數的每位數全部加總起來。

3. 輸入輸出:
(1) 輸入說明
    先輸入一個正整數代表後測試資料的數量
    依測試資料的數量,再輸入正整數的測試資料
(2) 輸出說明
     將測試資料的每位數全部加總
(3) 輸入與輸出會交雜如下,輸出之項目以粗體字表示
    1
98769
Sum·of·all·digits·of·98765·is·35

(4) 輸入與輸出會交雜如下,輸出之項目以粗體字表示
    3
    32412
    Sum·of·all·digits·of· 32412· is· 12
    0
    Sum·of·all·digits·of· 0· is· 0
    769
    Sum·of·all·digits·of· 769· is· 22
'''
total = eval(input())

for i in range(total):
    num = eval(input())
    tmp=num
    sum_digit=0
    while tmp !=0:
            sum_digit += tmp%10
            tmp //=10
    print("Sum of all digits of %d is %d"%(num, sum_digit))

#綜合範例09
'''請使用迴圈敘述撰寫一程式,提示使用者輸入金額(如10,000)、年收益率(如 5.75),
以及經過的月份數(如5),接著顯示每個月的存款總額。
* 提示:四捨五入,輸出浮點數到小數點後第二位。
* 舉例:假設您存款$10,000,年收益為5.75%。
 過了一個月,存款會是:10000 + 10000 * 5.75 / 1200 = 10047.92
過了兩個月,存款會是:10047.92 + 10047.92 * 5.75/1200 = 10096.06
過了三個月,存款將是:10096.06 + 10096.06 * 5.75/1200 = 10144.44'''
'''範例輸入
50000
1.3
5
output : Month     Amount
        1      50054.17
        2      50108.39
        3      50162.68
        4      50217.02
        5      50271.42'''
amount = eval(input())
rate = eval(input())
months = eval(input())

total = amount
print('%s \t  %s'  % ('Month', 'Amount'))
for i in range(1, months + 1):
    total += total * rate / 1200 # total = total + total * rate / 1200
    print('%3d \t %.2f' %(i, total))

#綜合範例10
#請使用迴圈敘述撰寫一程式,讓使用者輸入正整數n (1<n),計算以下公式的總和
#並顯示結果:
'''綜合範例 10:
迴圏公式計算

1. 題目說明:
請開啟 PYD03.py 檔案,依下列題意進行作答,依公式計算總和,使輸出值符合題意要求。
請另存新檔為 PYA03.py,作答完成請儲存所有檔案至 C:\ANS.CSF 原資料夾内。

2. 設計說明:
(1) 請使用迴圈敘述撰寫一程式,讓使用者輸入正整數n (1<n),計算以下公式的總和
     並顯示結果:
 1/(1+√2) +(後續不知道怎麼key)
* 提示:輸出結果至小數點後四位。

3. 輸入輸出:
(1) 輸入說明
一個正整數
 (2) 輸出說明
代入公式計算結果
 (3) 範例輸入
      8
     範例輸出
     1.8284
'''
n = eval(input())
sum_series = 0

for i in range(2, n+1):
     sum_series += 1 / ((i-1)**0.5 + i**0.5)
print("%.4f" % sum_series)

#綜合範例11
'''請使用迴圈敘述撰寫一程式,預測未來學費。假設第一年的學費由使用者輸入,而學費每年漲3%,試計算幾年後學費會變成兩倍。
範例輸入:10000
output: #1  year: 1030.00
        #2  year: 1060.90
        #3  year: 1092.73
        #4  year: 1125.51
        #5  year: 1159.27
        #6  year: 1194.05
        #7  year: 1229.87
        #8  year: 1266.77
        #9  year: 1304.77'''
tuition = eval(input())
year = 0
tuitionD = tuition * 2
while  tuition < tuitionD:
      year += 1
      tuition *= 1.03 # tuition = tuition * 1.03
      print('#%d  year: %.2f ' %(year, tuition))

print('Tuition will be doubled in %d year ' %(year))

#綜合範例12
'''請使用迴圈敘述撰寫一程式,將華氏溫度 10 度到240 度轉為其對應的攝氏溫度。
* 提示:攝氏溫度 = 5/9 *(華氏溫度-32)。'''
'''output:  華氏  攝氏
 10      -12.22
 20       -6.67
 30       -1.11
 40        4.44
 50       10.00
 60       15.56
 70       21.11
 80       26.67
 90       32.22
 100      37.78
 110      43.33'''
print(' 華氏  攝氏 ')
for  F  in range(10, 250, 10):
      C = 5/9 * (F-32)
      print( ' %-4d  %8.2f ' %(F, C))
#綜合範例13
'''請使用迴圈敘述撰寫一程式,然後計算: 1/3 + 3/5 + 5/7 + 7/9 + 9/11 + ...+ (n-2)/(n) '''
#範例輸入:99
#output: 45.12445
n = eval (input())
total = 0

for i in range(n, 2, -2):  # range(3, n+2, 2)
     print(i)
     total += (i-2)/i      # 
     print(total)
print('total = %.5f ' %(total))

#綜合範例14
'''請使用迴圈敘述撰寫一程式,然後計算:
1 + 1/2 + 1/3  + 1/4  + 1/5 + ...+ 1/n '''
#範例輸入:50000
#output: 1 + 1/2 + 1/3 + 1/4 +... + 1/n =   11.397003949278504
n = eval(input())
total = 0
for i in range(1, n+1):
     total += 1.0 / i
print( '1 + 1/2 + 1/3 + 1/4 +... + 1/n =  ' ,  total)

#綜合範例15
'''請使用迴圈敘述撰寫一程式,然後計算:
1/n + 1/(n-1) + 1/(n-2) + 1/(n-3) + 1/(n-4) + ...+1'''
#範例輸入同上
n = eval(input())
total = 0
for i in range(n,  0,  -1):
     total += 1.0 / i
print('1/n + 1/(n-1) + 1/(n-2)+... + 1 =  ' , total)
'''由綜合範例 15 與綜合範例 14 得知,
1/n + 1/(n-1)  + 1/(n-2)+... +1 比 1+1/2 + 1/3 + 1/4+...+1/n
兩者相差1.4210854715202004e-14 '''
